In [60]:
import pandas as pd
import os

In [27]:
# List of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]
high_schools

['Hernandez High School',
 'Figueroa High School',
 'Wilson High School',
 'Wright High School']

In [28]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [29]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
for types in high_school_types:
    print(types)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [40]:
# List of high schools
high_schools = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [45]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [46]:
school_id = [0,1,2,3,4]
school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

schools_df =  pd.DataFrame()

In [47]:
schools_df["School Id"] = school_id

In [48]:
schools_df["School Name"] = school_name

In [49]:
schools_df["Type"] = type_of_school

In [50]:
schools_df

   School Id            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [55]:
hs_df_dict = pd.DataFrame.from_dict(high_school_dicts)

hs_df_dict

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [56]:
schools_df.columns

Index(['School Id', 'School Name', 'Type'], dtype='object')

In [57]:
schools_df.index

RangeIndex(start=0, stop=5, step=1)

In [58]:
schools_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [59]:
school_id = [0,1,2,3,4,5,6,7,8,9,10]
school_name = ["Huang", "Figueroa", "Shelton", "Hernandez", "Griffin", "Wilson", "Cabrera", "Bailey", "Holden", "Pena", "Wright"]
school_type = ["Charter", "charter", "Charter", "District", "Disctrict", "Charter", "Charter", "District","District", "Charter", "Charter"]

new_df = pd.DataFrame()
new_df["School Id"] = school_id
new_df["School Name"] = school_name
new_df["Type"] = school_type

new_df

    School Id School Name       Type
0           0       Huang    Charter
1           1    Figueroa    charter
2           2     Shelton    Charter
3           3   Hernandez   District
4           4     Griffin  Disctrict
5           5      Wilson    Charter
6           6     Cabrera    Charter
7           7      Bailey   District
8           8      Holden   District
9           9        Pena    Charter
10         10      Wright    Charter

In [63]:
student_data_file = os.path.join("Resources","new_student_data.csv")

In [65]:
student_data_df = pd.read_csv(student_data_file)
student_data_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public